//ターミナル上でのロゴ表示
#include <cstdio>
#include <cstdlib>

extern "C" void main(int argc, char** argv) {
	printf(" __                                                                __                                                         \n");
	printf("|  \\                                                              |  \\                                                        \n");
	printf("| $$                    ______                ______              | $$             __    __               _______             \n");
	printf("| $$                   |      \\              /      \\             | $$            |  \\  |  \\             /       \\            \n");
	printf("| $$                    \\$$$$$$\\            |  $$$$$$\\            | $$            | $$  | $$            |  $$$$$$$            \n");
	printf("| $$                   /      $$            | $$  | $$            | $$            | $$  | $$             \\$$    \\             \n");
	printf("| $$_____             |  $$$$$$$            | $$__/ $$            | $$            | $$__/ $$             _\\$$$$$$\\            \n");
	printf("| $$     \\             \\$$    $$            | $$    $$            | $$             \\$$    $$            |       $$            \n");
	printf(" \\$$$$$$$$              \\$$$$$$$            | $$$$$$$              \\$$              \\$$$$$$              \\$$$$$$$             \n");
	printf("                                            | $$                                                                              \n");
	printf("                                            | $$                                                                              \n");
	printf("                                             \\$$                                                                              \n");
}
